tips=["Sn小提示大概一分钟一次","小Sn最可爱啦🩷","这服是2025-10-31建成的，是万圣节呢。","前服主号丢了，现在是副服主+吉祥物，太可怜了。","这服是前服主开来模仿Apex的，不过Sn接手后就不像apex了","本服 所有 建筑都是原创，如有雷同就是你抄袭","1号地图是Sn一次做梦梦到的，太漂亮了，印象很深","祝你有愉快的一天！","1号地图没有使用任何自然地形呢，每个方块都是我们建的人工地形啊。","叫大姐姐，乖","1号地图——大桥好像弄太大了，成狙击枪的天堂了。","服主是女的","写建议去建议区丢进建议箱建议","周末星期天的下午是服主最闲的时候，往往都在线","服主和管理们主要用boxim(盒子im)进行沟通，那里可以加服主好友，用户名就叫\"Sna3s\"","14-12-2025新增的特性:聊天室信息开始是\"@\"的话就会变红色哦","服主上线时可能看不见你的信息哦，因为我在挂机:P","你去Cube Warfare有几率见到服主","出bug就赶紧按出生点的那个初始命令方块吧,可能可以修好","加载中...","有问题问之前看看\"游戏玩法 任务位置\"，有很详细的资讯。","出生点大厅超大的:3","5号图本来是前服主想抄三角洲，现在大改了完全是原创","服主在改代码的时候 切勿朝服主丢书和站在服主旁丢投掷物","要申请管理或任何职位的都在boxim(盒子im)跟服主沟通哦~","严 禁 开 挂，祝开挂者走路永远踢到脚趾头，倒刺越拔越长，困的时候总是睡不着","请不要恶意破坏别人游戏体验，如针对打击某人","服主最讨厌刷屏了，警告无果直接ban","7号图和合成系统更新是16-2-2026哦，新年的前一天"]
notallowed = ["Moonstone Explosive","RPG", "Fireball", "Grenade Launcher","Super RPG","Bouncy Bomb", "Iceball","Moonstone Remote Explosive","Toxin Ball","Minigun"
,"Kill Spikes","Stick","WorldBuilder Wand","Floor Creator","Tribe Protector","Grass Block","Boat","Mob Catcher","Gold Watermelon Slice","Gold Fragment","Cooked Porkchop","Wheat Seeds"]
GunAmount = 7
Gun=["M1911","MP40","AK-47","M16","AWP","Double Barrel","Minigun"]
GunName=["轻盈","狂热","冲锋","嗜血","护目镜","敖犬","暴风"]
GunMaxAmmo=[16,300,300,300,80,100,1000]
GunTier=["Tier 1","Tier 2","Tier 2","Tier 2","Tier 3","Tier 3","Tier 4"]
GunCChance=[0.3,0.05,0.05,0.05,0,0,0]
GunBChance=[0,0.2,0.2,0.2,0.05,0.05,0]
GunAChance=[0,0,0,0,0.5,0.5,0]
GunSChance=[0,0,0,0,0,0,0]
MoneyAmount = 3
Money = ["Gold Coin","Gold Bar","Raw Gold"]
MoneyName=["金币","压缩金币","2级压缩金币"]
ChestRarity=[0.1,0.35,0.5,0.75]
ChestItem=[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,115,132,136]
ChestItemPrice=[10,10,20,20,20,30,50,70,100,150,200,200,250,300,300,300,350,450,600,800,800,850,900,1000,2000,2500,3000,3000,3200,3500,5000,10000,24000,30000,72000,88000,299700,"不可售卖",500,3000]
ChestItemRarity = [
    0.000, 0.000, 0.050, 0.050, 0.100, 0.100, 0.150, 0.150, 0.200, 0.200,
    0.250, 0.250, 0.280, 0.280, 0.300,
    0.320, 0.350, 0.380, 0.400, 0.420, 0.450, 0.480, 0.500, 0.520, 0.550,
    0.580,
    0.620, 0.650, 0.680, 0.710, 0.740, 0.770, 0.830,
    0.860, 0.890, 0.930, 1, 0.600, 0.300, 0.600
]
openChestText= ["打开C级箱","打开B级箱","打开A级箱","打开S级箱","重启状态..."]
chinStringAntiCheat=["Sn反作弊系统","疑似开挂|原因:穿墙挂(多次被踢就绝对是挂，请ban)","请在场管理尽快处理!!!!!","疑似开挂|原因:一分钟十杀","疑似开挂|原因:一秒>30(电脑)50(手机)点击","警告:你点击过快，有可能会被踢"]
cuteSnChinese01=["嗜血","狂热","冲锋","护目镜","破败军械---亡灵战斧","沙鹰","电击枪","龙狙","动力蝴蝶刀","离子火花剑","静默装置","锁血图腾","[服务器] ","触发连击!","真伤70，打中人概率触发连击再打一次","年兽角","幸运:爆率x2"]
cuteSnChinese02=["玩家","🩷是集指令和建筑于一身的Sn呀!","客服{玩家部门}","Apex服专用bug猎手{特殊职位}","防盗专员{特殊职位}","玩家回馈大使{玩家部门}","反外挂专员{管理部门}","试用管理{管理部门}","地图建筑师{特殊职位}","Apex服宣传大使{特殊职位}","Apex服创意总监{特殊职位}","仓库管理员{特殊职位}","人事部总理{管理及玩家部门}","Apex服Sn的創意貓貓","文明大使{管理部门}","金融管理{管理部门}","Sn的可爱小猫猫","威胁Sn要副腐竹要不然说要找到Sn家地址定位然后把Sn绑进小黑屋的可恶Deep[这个称号在3月14之前不会改:3]","牢狱管理{管理部门}","调查员{管理部门}"]
cuteSnChinese03=["私聊 ","🩷服主私聊","玩家不存在","传送 ","内部频道 ","内部頻道 ","⚙️内部频道","踢掉 ","踢掉 ","[管理踢人汇报] 管理","已经踢掉","，如果有乱ban情况请截图.","把你踢掉了.如有误判，请截图.","不能踢内部人员!"]
cuteSnChinese04=["啊，","太危险了，我帮你收起来哈","猫猫奖章ฅ^>⩊<^ฅ","获得这个平均得一直在线一小时啊，肝帝！","[服务器] 恭喜 "," 获得十二个猫猫事件!现颁发奖章一枚!","[服务器] ","特殊事件：聊天室猫猫","集齐十二个有好事发生哦~平均10分钟一个:3","Sn的小提示: ","，蓝苹果是违禁品哦~"]
cuteSnChinese05=["龙狙增伤等级 I","龙狙增伤等级 II","龙狙增伤等级 III","龙狙增伤等级 IV","龙狙增伤等级 V"]
cuteSnChinese06=["聚变之核","Boss奖励房钥匙","蕴含着巨大核能量的核心，不过他为什么会出现在骨头里呢？","开箱!!!","===[boss]聚变之骨[boss]==="]
cuteSnChinese07=["闪光","燃烧","电磁脉冲"]
cuteSnChinese08=["新年烟花--祝大家马年快乐![$不可售卖]","右键释放获得红包!","压缩金币","2级压缩金币","通用货币","新年红包(普通)","新年红包(特别)","右键获得1-999金锭不等!"]
cuteSnChinese09=["[服务器] ","激光枪冷却中...","龙息重炮冷却中...","大招释放失败(电磁脉冲)"]
cuteSnChinese10=["[Sn合成系统] ","请在聊天室输入合成表编号和合成数量，例如\"0 1\"代表1个0号合成表，\"12 3\"代表3个12号合成表.","你没有足够的物资合成..."]
cuteSnChinese11=["[Sn自动仓库系统] ","搜索可用仓库中...","仓库系统执行中，请勿再次执行","已购买","号仓库并扣费999粗金.","搜索你的仓库中...","找不到你的仓库.","已找到并传送至你的仓库.","仓库已满，没有可用仓库.","已找到可用仓库.","粗金不足999，购买失败."]
functionDefined[2] = 1
void 0;
